{
    "data": [
        {
            "title": "BestFit Demo Parser",
            "screenshots": [
                "/src/images/phoyo_circle.png",
                "images/nusmods-2.jpg"
            ],
            "description": "<p><strong><a href='http://bestfitparserdev.infolytx.net' target='_blank'>BestFit Parser Demo</a></strong>is a AI based solution where candidates and employeer get the most our of AI technology, It parse the CV and rank them based on Job Description</p>",
            "tags": [
                "ReactJS",
                "Python",
                "AI"
            ]
        },
        {
            "title": "Una",
            "screenshots": [
                "images/una.jpg"
            ],
            "description": "<p><strong><a href='http://una-org.github.io/' target='_blank'>Una</a></strong> is a free and open source Javascript library that allows developers to create interactive applications where multiple users can interact with large central displays in real-time using mobile devices.</p><p>This project was completed in the course of CS3216 Software Development on Evolving Platforms and won the <strong>Best Project Award</strong> for STePS (NUS School of Computing Term Project Showcase) 2013/14 Semester I.</p>",
            "tags": [
                "Node.js",
                "Socket.io",
                "Express"
            ]
        },
        {
            "title": "Nutty Ninjas",
            "screenshots": [
                "images/nutty-ninjas-1.jpg",
                "images/nutty-ninjas-2.jpg"
            ],
            "description": "<p><strong><a href='http://nuttyninjas.com/' target='_blank'>Nutty Ninjas</a></strong> is a real-time shooter that brings the experience of social multiplayer gaming to a whole new level; it is a console-style game that can be played anywhere and anytime, simply with your computer and mobile devices. Multiple players can join a common gameplay screen just by using their mobile devices, and control their ninja character to unleash dangerous weapons at fellow players!</p><p>It was developed using the cross-display interaction library <a href='http://una-org.github.io/' target='_blank'>Una</a></strong>. I played the role of UI/UX designer and front-end developer for this project.</p>",
            "tags": [
                "Node.js",
                "Una",
                "Socket.io",
                "Express",
                "Box2D",
                "AngularJS"
            ]
        },
        {
            "title": "EasilyDo Corporate Site",
            "screenshots": [
                "images/easilydo.jpg"
            ],
            "description": "<p><strong><a href='http://www.easilydo.com' target='_blank'>EasilyDo's</a></strong> corporate site was solely developed and maintained by me while I was an interning at EasilyDo. I also developed the site's plugins to maintain a responsive layout. A Wordpress theme was created for the EasilyDo blog so that it was consistent with the other static pages of the site.</p>",
            "tags": [
                "Wordpress",
                "AngularJS"
            ]
        },
        {
            "title": "Corspedia",
            "screenshots": [
                "images/corspedia.jpg"
            ],
            "description": "<p><strong><a href='http://www.corspedia.com' target='_blank'>Corspedia</a></strong> is an easy-to-use search engine for National University of Singapore's CORS Bidding Archives. It provides a clean and simple interface for students to search for the bidding history of any module. Built using AngularJS and Google App Engine.</p>",
            "tags": [
                "Node.js",
                "Express",
                "Google App Engine",
                "AngularJS",
                "Pure"
            ]
        },
        {
            "title": "Osmose",
            "screenshots": [
                "images/osmose-1.jpg",
                "images/osmose-2.jpg"
            ],
            "description": "<p><strong>Osmose</strong> is a platform to facilitate the interaction and sharing between students and instructors of a course. Students can ask questions, answer questions from their peers, and also share new findings with one another.</p>",
            "tags": [
                "Sails.js",
                "Express",
                "AngularJS",
                "Foundation"
            ]
        },
        {
            "title": "#ifihadglass",
            "screenshots": [
                "images/ifihadglass.jpg"
            ],
            "description": "<p>My entry for Google's <strong>#ifihadglass</strong> competition where participants demonstrate potential uses for Google Glass and selected entries can be part of the Glass Explorer Program. I used jQuery and HTML5/CSS to simulate the Google glass interface to demonstrate potential use-cases of Google Glass. View the full site <strong><a href='http://yangshun.im/ifihadglass/' target='_blank'>here</a></strong>.</p>",
            "tags": [
                "jQuery"
            ]
        }
    ]
}